tillitis/tillitis-key1/hw/usb_interface/ch552_fw/src/main.c
// FIDO Device Descriptor (copy from FidoDesc)
FLASH uint8_t FidoCfgDesc[] = {
        0x09,                             /* bLength: HID Descriptor size */
        USB_DESC_TYPE_HID,                /* bDescriptorType: HID */
        0x11,                             /* bcdHID (low byte): HID Class Spec release number */
        0x01,                             /* bcdHID (high byte): HID Class Spec release number */
        0x00,                             /* bCountryCode: Hardware target country */
        0x01,                             /* bNumDescriptors: Number of HID class descriptors to follow */
        USB_DESC_TYPE_REPORT,             /* bDescriptorType: Report */
        LOBYTE(FIDO_REPORT_DESC_SIZE),    /* wDescriptorLength (low byte): Total length of Report descriptor */
        HIBYTE(FIDO_REPORT_DESC_SIZE),    /* wDescriptorLength (high byte): Total length of Report descriptor */
};

FLASH uint8_t FidoReportDesc[] ={
        0x06, 0xD0, 0xF1,                 /* Usage Page (FIDO Alliance Page) */
        0x09, 0x01,                       /* Usage (U2F Authenticator Device) */
        0xA1, 0x01,                       /*   Collection (Application) */
        /* 7 */
        0x09, 0x20,                       /*     Usage (Input Report Data) */
        0x15, 0x00,                       /*     Logical Minimum (0) */
        0x26, 0xFF, 0x00,                 /*     Logical Maximum (255) */
        0x75, 0x08,                       /*     Report Size (8) */
        0x95, MAX_PACKET_SIZE,            /*     Report Count (64) */
        0x81, 0x02,                       /*     Input (Data, Variable, Absolute); */
        /* 20 */
        0x09, 0x21,                       /*     Usage (Output Report Data) */
        0x15, 0x00,                       /*     Logical Minimum (0) */
        0x26, 0xFF, 0x00,                 /*     Logical Maximum (255) */
        0x75, 0x08,                       /*     Report Size (8) */
        0x95, MAX_PACKET_SIZE,            /*     Report Count (64) */
        0x91, 0x02,                       /*     Output (Data, Variable, Absolute) */
        /* 33 */
        0x09, 0x07,                       /*     Usage (7, Reserved) */
        0x15, 0x00,                       /*     Logical Minimum (0) */
        0x26, 0xFF, 0x00,                 /*     Logical Maximum (255) */
        0x75, 0x08,                       /*     Report Size (8) */
        0x95, 0x08,                       /*     Report Count (8) */
        0xB1, 0x02,                       /*     Feature (2) (???) */
        /* 46 */
        0xC0                              /*   End Collection */
        /* 47 */
};

// DEBUG Device Descriptor (copy from DebugDesc)
FLASH uint8_t DebugCfgDesc[] = {
        0x09,                             /* bLength: HID Descriptor size */
        USB_DESC_TYPE_HID,                /* bDescriptorType: HID */
        0x11,                             /* bcdHID (low byte): HID Class Spec release number */
        0x01,                             /* bcdHID (high byte): HID Class Spec release number */
        0x00,                             /* bCountryCode: Hardware target country */
        0x01,                             /* bNumDescriptors: Number of HID class descriptors to follow */
        USB_DESC_TYPE_REPORT,             /* bDescriptorType: Report */
        LOBYTE(DEBUG_REPORT_DESC_SIZE),   /* wDescriptorLength (low byte): Total length of Report descriptor */
        HIBYTE(DEBUG_REPORT_DESC_SIZE),   /* wDescriptorLength (high byte): Total length of Report descriptor */
};

// DEBUG Report Descriptor
FLASH uint8_t DebugReportDesc[] ={
        0x06, 0x00, 0xFF,                 /* Usage Page (Vendor Defined 0xFF00) */
        0x09, 0x01,                       /* Usage (Vendor Usage 1) */
        0xA1, 0x01,                       /*   Collection (Application) */
        /* 7 */
        0x09, 0x02,                       /*     Usage (Output Report Data), 0x02 defines that the output report carries raw data from the host to the device. */
        0x15, 0x00,                       /*     Logical Minimum (0) */
        0x26, 0xFF, 0x00,                 /*     Logical Maximum (255) */
        0x75, 0x08,                       /*     Report Size (8 bits) */
        0x95, MAX_PACKET_SIZE,            /*     Report Count (64 bytes) */
        0x91, 0x02,                       /*     Output (Data, Variable, Absolute) */
        /* 20 */
        0x09, 0x03,                       /*     Usage (Input Report), 0x03 defines that the input report carries raw data for the host. */
        0x15, 0x00,                       /*     Logical Minimum (0) */
        0x26, 0xFF, 0x00,                 /*     Logical Maximum (255) */
        0x75, 0x08,                       /*     Report Size (8 bits) */
        0x95, MAX_PACKET_SIZE,            /*     Report Count (64 bytes) */
        0x81, 0x02,                       /*     Input (Data, Variable, Absolute) */
        /* 33 */
        0xC0                              /*   End Collection */
        /* 34 */
};

// String Descriptor (Language descriptor )
FLASH uint8_t LangDesc[] = {
        4,           // Length of this descriptor (in bytes)
        0x03,        // Descriptor type (String)
        0x09, 0x04,  // Language ID (English - US)
};

// CDC Parameters: The initial baud rate is 500000, 1 stop bit, no parity, 8 data bits.
FLASH uint8_t LineCoding[7] = { 0x20, 0xA1, 0x07, 0x00, /* Data terminal rate, in bits per second: 500000 */
                                                  0x00, /* Stop bits: 0 - 1 Stop bit, 1 - 1.5 Stop bits, 2 - 2 Stop bits */
                                                  0x00, /* Parity: 0 - None, 1 - Odd, 2 - Even, 3 - Mark, 4 - Space */
                                                  0x08, /* Data bits (5, 6, 7, 8 or 16) */
                                };

#define UART_TX_BUF_SIZE     64   // Serial transmit buffer
#define UART_RX_BUF_SIZE     140  // Serial receive buffer

/** Communication UART */
XDATA uint8_t UartTxBuf[UART_TX_BUF_SIZE] = { 0 };  // Serial transmit buffer
volatile IDATA uint8_t Ep2ByteLen;
volatile IDATA uint8_t Ep3ByteLen;
volatile IDATA uint8_t Ep4ByteLen;

XDATA uint8_t UartRxBuf[UART_RX_BUF_SIZE] = { 0 };  // Serial receive buffer
volatile IDATA uint8_t UartRxBufInputPointer = 0;   // Circular buffer write pointer, bus reset needs to be initialized to 0
volatile IDATA uint8_t UartRxBufOutputPointer = 0;  // Take pointer out of circular buffer, bus reset needs to be initialized to 0
volatile IDATA uint8_t UartRxBufByteCount = 0;      // Number of unprocessed bytes remaining in the buffer

/** Debug UART */
#ifdef DEBUG_PRINT_HW
#define DEBUG_UART_RX_BUF_SIZE        8
XDATA uint8_t DebugUartRxBuf[DEBUG_UART_RX_BUF_SIZE] = { 0 };
volatile IDATA uint8_t DebugUartRxBufInputPointer = 0;
volatile IDATA uint8_t DebugUartRxBufOutputPointer = 0;
volatile IDATA uint8_t DebugUartRxBufByteCount = 0;
#endif

/** Endpoint handling */
volatile IDATA uint8_t UsbEp2ByteCount = 0;     // Represents the data received by USB endpoint 2 (CDC)
volatile IDATA uint8_t UsbEp3ByteCount = 0;     // Represents the data received by USB endpoint 3 (FIDO)
volatile IDATA uint8_t UsbEp4ByteCount = 0;     // Represents the data received by USB endpoint 4 (DEBUG)

volatile IDATA uint8_t Endpoint2UploadBusy = 0; // Whether the upload endpoint 2 (CDC) is busy
volatile IDATA uint8_t Endpoint3UploadBusy = 0; // Whether the upload endpoint 3 (FIDO) is busy
volatile IDATA uint8_t Endpoint4UploadBusy = 0; // Whether the upload endpoint 4 (DEBUG) is busy

/** CH552 variables */
IDATA uint8_t CH552DataAvailable = 0;

/** DEBUG variables */
IDATA uint8_t DebugDataAvailable = 0;

/** CDC variables */
IDATA uint8_t CdcDataAvailable = 0;

