tillitis/tillitis-key1/hw/usb_interface/ch552_fw/src/main.c
    ActiveCfgDesc[2] = ActiveCfgDescSize;
    ActiveCfgDesc[4] = num_iface;
}

/*******************************************************************************
 * Function Name  : Config_Uart1(uint8_t *cfg_uart)
 * Description    : Configure serial port 1 parameters
 * Input          : Serial port configuration parameters Four bit baud rate, stop bit, parity, data bit
 * Output         : None
 * Return         : None
 *******************************************************************************/
void Config_Uart1(uint8_t *cfg_uart)
{
    uint32_t uart1_baud = 0;
    *((uint8_t*) &uart1_baud) = cfg_uart[0];
    *((uint8_t*) &uart1_baud + 1) = cfg_uart[1];
    *((uint8_t*) &uart1_baud + 2) = cfg_uart[2];
    *((uint8_t*) &uart1_baud + 3) = cfg_uart[3];
    SBAUD1 = 256 - FREQ_SYS / 16 / uart1_baud;   // SBAUD1 = 256 - Fsys / 16 / baud rate
    IE_UART1 = 1; // Enable UART1 interrupt
}

void usb_irq_setup_handler(void)
{
    uint16_t len = USB_RX_LEN;
    printStrSetup("Setup ");

    if (len == (sizeof(USB_SETUP_REQ))) {
        SetupLen = ((uint16_t) UsbSetupBuf->wLengthH << 8) | (UsbSetupBuf->wLengthL);
        len = 0; // Defaults to success and uploading 0 length
        SetupReq = UsbSetupBuf->bRequest;

        // Class-Specific Requests, i.e. HID request, CDC request etc.
        if ((UsbSetupBuf->bmRequestType & USB_REQ_TYPE_MASK) != USB_REQ_TYPE_STANDARD) {
            printStrSetup("Class-Specific ");
            printStrSetup("SetupReq=");
            printStrSetup("0x");
            printNumU8HexSetup(SetupReq);
            printStrSetup(" ");
            switch(SetupReq) {
            case USB_HID_REQ_TYPE_GET_REPORT:
                printStrSetup("HID Get Report\n");
                break;
            case USB_HID_REQ_TYPE_GET_IDLE:
                printStrSetup("HID Get Idle\n");
                break;
            case USB_HID_REQ_TYPE_GET_PROTOCOL:
                printStrSetup("HID Get Protocol\n");
                break;
            case USB_HID_REQ_TYPE_SET_REPORT:
                printStrSetup("HID Set Report\n");
                break;
            case USB_HID_REQ_TYPE_SET_IDLE:
                printStrSetup("HID Set Idle\n");
                break;
            case USB_HID_REQ_TYPE_SET_PROTOCOL:
                printStrSetup("HID Set Protocol\n");
                break;
            case USB_CDC_REQ_TYPE_SET_LINE_CODING:
                printStrSetup("CDC Set Line Coding\n");
                break;
            case USB_CDC_REQ_TYPE_GET_LINE_CODING:
                printStrSetup("CDC Get Line Coding\n");
                pDescr = LineCoding;
                len = sizeof(LineCoding);
                len = SetupLen >= DEFAULT_EP0_SIZE ? DEFAULT_EP0_SIZE : SetupLen; // The length of this transmission
                memcpy(Ep0Buffer, pDescr, len);
                SetupLen -= len;
                pDescr += len;
                break;
            case USB_CDC_REQ_TYPE_SET_CONTROL_LINE_STATE: // Generates RS-232/V.24 style control signals
                printStrSetup("CDC Set Control Line State\n");
                break;
            default:
                len = 0xFF; // Command not supported
                printStrSetup("Unsupported\n");
                break;
            }
        } // END Non-standard request

        else { // Standard Requests
            // Request code
            switch (SetupReq) {
            case USB_GET_DESCRIPTOR: {
                switch (UsbSetupBuf->wValueH) {
                case USB_DESC_TYPE_DEVICE: // Device descriptor
                    pDescr = DevDesc; // Send the device descriptor to the buffer to be sent
                    len = sizeof(DevDesc);
                    printStrSetup("DevDesc\n");
                    break;
                case USB_DESC_TYPE_CONFIGURATION: // Configuration descriptor
                    pDescr = ActiveCfgDesc; // Send the configuration descriptor to the buffer to be sent
                    len = sizeof(ActiveCfgDesc);
                    printStrSetup("CfgDesc\n");
                    break;
                case USB_DESC_TYPE_STRING: // String descriptors
                    if (UsbSetupBuf->wValueL == USB_IDX_LANGID_STR) {
                        pDescr = LangDesc;
                        len = sizeof(LangDesc);
                        printStrSetup("LangDesc\n");
                    } else if (UsbSetupBuf->wValueL == USB_IDX_MFC_STR) {
                        pDescr = ManufDesc;
                        len = sizeof(ManufDesc);
                        printStrSetup("ManufDesc\n");
                    } else if (UsbSetupBuf->wValueL == USB_IDX_PRODUCT_STR) {
                        pDescr = ProdDesc;
                        len = sizeof(ProdDesc);
                        printStrSetup("ProdDesc\n");
                    } else if (UsbSetupBuf->wValueL == USB_IDX_SERIAL_STR) {
                        pDescr = SerialDesc;
                        len = sizeof(SerialDesc);
                        printStrSetup("SerialDesc\n");
                    } else if (UsbSetupBuf->wValueL == USB_IDX_INTERFACE_CDC_CTRL_STR) {
                        pDescr = CdcCtrlInterfaceDesc;
                        len = sizeof(CdcCtrlInterfaceDesc);
                        printStrSetup("CdcCtrlInterfaceDesc\n");
                    } else if (UsbSetupBuf->wValueL == USB_IDX_INTERFACE_CDC_DATA_STR) {
                        pDescr = CdcDataInterfaceDesc;
                        len = sizeof(CdcDataInterfaceDesc);
                        printStrSetup("CdcDataInterfaceDesc\n");
                    } else if (UsbSetupBuf->wValueL == USB_IDX_INTERFACE_FIDO_STR) {
                        pDescr = FidoInterfaceDesc;
                        len = sizeof(FidoInterfaceDesc);
                        printStrSetup("FidoHidInterfaceDesc\n");
                    } else if (UsbSetupBuf->wValueL == USB_IDX_INTERFACE_DEBUG_STR) {
                        pDescr = DebugInterfaceDesc;
                        len = sizeof(DebugInterfaceDesc);
                        printStrSetup("DebugInterfaceDesc\n");
                    } else {
                        printStrSetup("Error: USB_DESC_TYPE_STRING\n");
                    }
                    break;
                case USB_DESC_TYPE_HID:
                    if (UsbSetupBuf->wIndexL == FidoInterfaceNum) { // Interface number for FIDO
                        pDescr = FidoCfgDesc;
                        len = sizeof(FidoCfgDesc);
                        printStrSetup("FidoCfgDesc\n");
                    } else if (UsbSetupBuf->wIndexL == DebugInterfaceNum) { // Interface number for DEBUG
                        pDescr = DebugCfgDesc;
                        len = sizeof(DebugCfgDesc);
                        printStrSetup("DebugCfgDesc\n");
                    }
                    break;
                case USB_DESC_TYPE_REPORT:
                    if (UsbSetupBuf->wIndexL == FidoInterfaceNum) { // Interface number for FIDO
                        pDescr = FidoReportDesc;
                        len = sizeof(FidoReportDesc);
                        printStrSetup("FidoReportDesc\n");
                    } else if (UsbSetupBuf->wIndexL == DebugInterfaceNum) { // Interface number for DEBUG
                        pDescr = DebugReportDesc;
                        len = sizeof(DebugReportDesc);
                        printStrSetup("DebugReportDesc\n");
                    }
                    break;
                default:
                    len = 0xFF; // Unsupported command or error
                    printStrSetup("Unsupported\n");
                    break;
                }

