tillitis/tillitis-key1/hw/usb_interface/ch552_fw/src/main.c
        case UIS_TOKEN_OUT | 4: // Endpoint 4 OUT (RX), Endpoint batch download
            // Out-of-sync packets will be dropped
            if (U_TOG_OK) {
                UsbEp4ByteCount = USB_RX_LEN;                              // Length of received data
                UEP4_CTRL = (UEP4_CTRL & ~MASK_UEP_R_RES) | UEP_R_RES_NAK; // NAK after receiving a packet of data, the main function finishes processing, and the main function modifies the response mode
                UEP4_CTRL ^= bUEP_R_TOG;                                   // Sync flag flip
            }
            break;

        default:
            break;
        }

        UIF_TRANSFER = 0; // Writing 0 clears the interrupt

    } else if (UIF_BUS_RST) { // Check device mode USB bus reset interrupt

        printStrSetup("Reset\n");

        UEP0_CTRL =                 UEP_T_RES_NAK | UEP_R_RES_ACK;
        UEP1_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK;
        UEP2_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK | UEP_R_RES_ACK;
        UEP3_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK | UEP_R_RES_ACK;
        UEP4_CTRL =                 UEP_T_RES_NAK | UEP_R_RES_ACK;
        USB_DEV_AD = 0x00;
        UIF_SUSPEND = 0;
        UIF_TRANSFER = 0;               // Writing 0 clears the interrupt
        UIF_BUS_RST = 0;                // Clear interrupt flag

        UartRxBufInputPointer = 0;      // Circular buffer input pointer
        UartRxBufOutputPointer = 0;     // Circular buffer read pointer
        UartRxBufByteCount = 0;         // The number of bytes remaining in the current buffer to be fetched
        UsbEp2ByteCount = 0;            // USB endpoint 2 (CDC) received length
        UsbEp3ByteCount = 0;            // USB endpoint 3 (FIDO) received length
        UsbEp4ByteCount = 0;            // USB endpoint 4 (DEBUG) received length
        Endpoint2UploadBusy = 0;        // Clear busy flag
        Endpoint3UploadBusy = 0;        // Clear busy flag
        Endpoint4UploadBusy = 0;        // Clear busy flag

        FrameMode = 0;

        UsbConfig = 0;                  // Clear configuration values

    } else if (UIF_SUSPEND) { // Check USB bus suspend/wake completed

        UIF_SUSPEND = 0;

        if (USB_MIS_ST & bUMS_SUSPEND) { // Hang

            printStrSetup("Suspend\n");

            while (XBUS_AUX & bUART0_TX) {
                ; // Wait for sending to complete
            }

            SAFE_MOD = 0x55;
            SAFE_MOD = 0xAA;
            WAKE_CTRL = bWAK_BY_USB | bWAK_RXD0_LO | bWAK_RXD1_LO; // Can be woken up when there is a signal from USB or RXD0/1
            PCON |= PD; // Sleep
            SAFE_MOD = 0x55;
            SAFE_MOD = 0xAA;
            WAKE_CTRL = 0x00;

        }
    } else { // Unexpected IRQ, should not happen
        printStrSetup("Unexpected IRQ\n");
        USB_INT_FG = 0xFF; // Clear interrupt flag
    }
}

/*******************************************************************************
 * Function Name  : Uart0_ISR()
 * Description    : Serial debug port receiving interrupt function to realize circular buffer receiving
 *******************************************************************************/
#ifdef DEBUG_PRINT_HW
#ifdef BUILD_CODE
#define IRQ_UART0 __interrupt(INT_NO_UART0)
#else
#define IRQ_UART0
#endif

void Uart0_ISR(void)IRQ_UART0
{
    // Check if data has been received
    if (RI) {
        DebugUartRxBuf[DebugUartRxBufInputPointer++] = SBUF;
        if (DebugUartRxBufInputPointer >= DEBUG_UART_RX_BUF_SIZE) {
            DebugUartRxBufInputPointer = 0; // Reset write pointer
        }
        RI = 0;
    }
}

uint8_t debug_uart_byte_count()
{
    uint8_t  in = DebugUartRxBufInputPointer;
    uint8_t out = DebugUartRxBufOutputPointer;

    if (in < out) {
        in = in + DEBUG_UART_RX_BUF_SIZE;
    }
    return in - out;
}
#endif

/*******************************************************************************
 * Function Name  : Uart1_ISR()
 * Description    : Serial port receiving interrupt function to realize circular buffer receiving
 *******************************************************************************/
#ifdef BUILD_CODE
#define IRQ_UART1 __interrupt(INT_NO_UART1)
#else
#define IRQ_UART1
#endif

void Uart1_ISR(void)IRQ_UART1
{
    // Check if data has been received
    if (U1RI) {
        UartRxBuf[UartRxBufInputPointer++] = SBUF1;
        if (UartRxBufInputPointer >= UART_RX_BUF_SIZE) {
            UartRxBufInputPointer = 0; // Reset write pointer
        }

        check_cts_stop();

        U1RI = 0;
    }
}

uint8_t uart_byte_count()
{
    uint8_t in = UartRxBufInputPointer;
    uint8_t out = UartRxBufOutputPointer;

    if (in >= out) {
        return (in - out);
    } else {
        return (UART_RX_BUF_SIZE - (out - in));
    }
}

// Copy data from a circular buffer
void circular_copy(uint8_t *dest, uint8_t *src, uint32_t src_size, uint32_t start_pos, uint32_t length) {

    // Calculate the remaining space from start_pos to end of buffer
    uint32_t remaining_space = src_size - start_pos;

    if (length <= remaining_space) {
        // If the length to copy doesn't exceed the remaining space, do a single memcpy
        memcpy(dest, src + start_pos, length);
    } else {
        // If the length to copy exceeds the remaining space, split the copy
        memcpy(dest, src + start_pos, remaining_space);                // Copy from start_pos to end of buffer
        memcpy(dest + remaining_space, src, length - remaining_space); // Copy the rest from the beginning of buffer
    }
}

// Function to increment a pointer and wrap around the buffer
uint32_t increment_pointer(uint32_t pointer, uint32_t increment, uint32_t buffer_size)
{
    return (pointer + increment) % buffer_size;
}

// Function to decrement a pointer and wrap around the buffer
uint32_t decrement_pointer(uint32_t pointer, uint32_t decrement, uint32_t buffer_size)
{
    return (pointer + buffer_size - (decrement % buffer_size)) % buffer_size;
}

void cts_start(void)
{
    gpio_p1_5_set(); // Signal to FPGA to send more data
}

void cts_stop(void)
{
    gpio_p1_5_unset(); // Signal to FPGA to not send more data
}

void check_cts_stop(void)
{
    if (uart_byte_count() >= 133) // UartRxBuf is filled to 95% or more
    {
        cts_stop();
    }
}

void main()
{
    CfgFsys();     // CH559 clock selection configuration
    mDelaymS(5);   // Modify the main frequency and wait for the internal crystal to stabilize, which must be added
#ifdef DEBUG_PRINT_HW
    mInitSTDIO();  // Serial port 0, can be used for debugging
#endif
    UART1Setup();  // For communication with FPGA
    UART1Clean();  // Clean register from spurious data

    printStrSetup("Startup\n");

    uint8_t ActiveEndpoints = RESET_KEEP;

